{
    "home": {
          "text": [
            "Hello and thanks for checking out my website! My name is David Bain. I am a certified front-end developer as well as an XR develepment manager working for Orbis Education. Please feel free to look through my website. In the footer I have links to my github, codepen, freeCodeCamp, and linkedIn profiles. I have experience with HTML, CSS, JavaScript, C, C#, ColdFusion, SQL, and NodeJS. I also have experience with jquery, bootstrap, AngularJS, and React.",
            "I also have a Bachelor’s degree in computer graphic design and have experience with several adobe programs. Lately I have been focusing on developing Unity applications for the microsoft hololens.",
            "If you would like to know any more information feel free to contact me! Thanks."
          ]
    },
    "resume": [
        {
            "title": "Education",
            "text": ["Lewis University 2012 Romeoville, IL",
            "Bachelor Degree of Arts in Computer Graphic Design GPA 3.72"]
        },
        {
            "title": "Achievements",
            "text": ["Certified Web Developer At FreeCodeCamp, (2016)",
            "Achievement Award At Lids, (2015)",
            "Departmental Senior Award At Lewis University, (2012)",
            "Published Piece and First Prize Winner in the Computer Graphic Design Category, Lewis University’s Fine Arts Magazine, Windows (2012)",
            "Honorable mention for the Photography Category, Lewis University Fine Arts Magazine Windows (2012)",
            "Academic Dean's List, 6 Semesters Academic Honors, 5"]
        },
        {
            "title": "Skills",
            "skills": [
              {
                "skill": "HTML",
                "years": 7
              },
              {
                "skill": "CSS",
                "years": 7
              },
              {
                "skill": "JavaScript",
                "years": 7
              },
              {
                "skill": "ColdFusion",
                "years": 5
              },
              {
                "skill": "NodeJS",
                "years": 5
              },
              {
                "skill": "SQL",
                "years": 5
              },
              {
                "skill": "AngularJS",
                "years": 5
              },
              {
                "skill": "React",
                "years": 5
              },
              {
                "skill": "C#",
                "years": 5
              },
              {
                "skill": "Unity",
                "years": 5
              },
              {
                "skill": "Adobe Software",
                "years": 9
              },
              {
                "skill": "Microsoft Office",
                "years": 10
              }
            ]
        },
        {
          "title": "Work Experience",
          "experience":
          [
            {
              "title": [
                "Orbis Education 2021, November 2021-Present",
                "Extended Reality (XR) Manager:"],
              "text": [
                "Created and developed company’s first XR and Mixed-reality Development team.",
                "Leads, coaches, and manages an engineer oriented XR development team.",
                "Creates an environment that supports creativity and professional growth opportunities.",
                "Utilizes Azure, IBM, and consistently remains attuned to developing technologies to enhance software deliverables.", 
                "Excels at emerging technologies, XR development, front and back-end web development, artificial intelligence communication through conversational AI, and spatial computing.",
                "Coaches and leads all staff to enhance, develop and create best possible XR patient and real-life clinical experience for nursing students.",
                "Completes all management duties and tasks for assigned staff members.",
                "Directs and provides hands-on coaching for staff developers to overcome engineering and complex code.",
                "Developed reusable code and workflow enhancements for high-performing team."
              ]
            },
            {
              "title": [
                "Orbis Education 2020, May 2020-November 2021",
                "Extended Reality (XR) Developer:"],
              "text": [
                "Developed Unity C# applications across multiple platforms.",
                "Created state of the art prototype for a mixed reality patient simulator.",
                "Created Unity C# SDK to help us deploy apps faster."
              ]
            },
            {
              "title": [
                "Orbis Education 2018, January 2018-May 2020",
                "Front End and Multimedia Developer II:"],
              "text": [
                "Developed single page applications from Flash to HTM5 and JavaScript.",
                "Created reusable json driven templates to speed up conversion.", 
                "Created dynamic web pages for the employee intranet.", 
                "Converted jquery templates to React-Redux.",
                "Maintained virtual medicine administration desktop application using Angular JS, Node JS, SQL Server, and Electron."
              ]
            },
            {
              "title": [
                "Orbis Education 2017, January 2018",
                "Front End and Multimedia Developer I:"],
              "text": [
                "Updates single page applications from Flash to HTML5 and JavaScript.",
                "Creates reusable json driven templates to speed up conversion.",
                "Creates dynamic web pages for the employee intranet."
              ]
            },
            {
              "title": [
                "Lids Team Sports 2013, October-January 2017",
                "Production Artist / Programmer:"],
              "text": [
                "Sets up artwork for production ensuring the best product design.",
                "Creates scripts with adobe software used in multiple departments to increase productivity.",
                "Creates dynamic web pages for the employee website.",
                "Manages multiple projects at a time with efficiency and accuracy.",
                "Exceeds expectations with work-flow efficiency and time management of projects."
              ]
            }
          ]
        },
        {
          "title": "References",
          "references": [
            {
              "name": "David Auble",
              "text": "Associate Director, Digital Engagement, Customer Experience, Eli Lilly and Company",
              "contact":  "dauble2k5@gmail.com, (317) 979-5297"
            },
            {
              "name": "Sydney Micklas",
              "text": "Platform Android Software Engineer, WillowTree",
              "contact":  "micklas.sydney@gmail.com, (248) 805-7403"
            },
            {
              "name": "Jim Cowan",
              "text": "Graphic Design Director Publications, Lewis University",
              "contact": "cowanji@lewisu.edu, (815) 836-5299"
            }
          ]
        }
    ],
    "portfolio": {
      "text": [
                "Welcome to my portfolio section. I have a handful of small apps displayed below. These were all made for freeCodeCamp projects. I recommend checking out my github and codepen accounts for more of my bigger projects. They are linked in the footer."
              ],
      "projects": [
        {
          "title": "Wikipedia Viewer",
          "description": "Below you will see a Wikipedia viewer app. Feel free to test out the search bar or hit the question mark for a random article. This was a fun project I used a bit of jquery and I gained some experience using Wikipedia’s API.",
          "html": "<p data-height=\"463\" data-theme-id=\"0\" data-slug-hash=\"RayyxK\" data-default-tab=\"result\" data-user=\"davidbaindesign\" data-embed-version=\"2\" class=\"codepen\">See the Pen <a href=\"http://codepen.io/davidbaindesign/pen/RayyxK/\">Wikipedia Viewer</a> by David Bain (<a href=\"http://codepen.io/davidbaindesign\">@davidbaindesign</a>) on <a href=\"http://codepen.io\">CodePen</a>.</p>",
          "img": "wiki.jpg"
        },
        {
          "title": "Simon Game",
          "description": "This is a simon game. It is a lot easier if you have the sound turned on. It was inspired by super nintendo.",
          "html": "<p data-height=\"463\" data-theme-id=\"0\" data-slug-hash=\"YWGNYv\" data-default-tab=\"result\" data-user=\"davidbaindesign\" data-embed-version=\"2\" class=\"codepen\">See the Pen <a href=\"http://codepen.io/davidbaindesign/pen/YWGNYv/\">Simon Game</a> by David Bain (<a href=\"http://codepen.io/davidbaindesign\">@davidbaindesign</a>) on <a href=\"http://codepen.io\">CodePen</a>.</p>",
          "img": "nintendo.jpg"
        },
        {
          "title": "Pomodoro",
          "description": "This is a pomodoro timer. You can adjust the time to however many minutes you want. I gained some experience using html canvas. I used the parametric equation to calculate the orbit of the little circle to align perfectly with the end of the stroked path.",
          "html": "<p data-height=\"600\" data-theme-id=\"0\" data-slug-hash=\"qNdOMd\" data-default-tab=\"result\" data-user=\"davidbaindesign\" data-embed-version=\"2\" class=\"codepen\">See the Pen <a href=\"http://codepen.io/davidbaindesign/pen/qNdOMd/\">Pomodoro Clock</a> by David Bain (<a href=\"http://codepen.io/davidbaindesign\">@davidbaindesign</a>) on <a href=\"http://codepen.io\">CodePen</a>.</p>",
          "img": "pomodoro.jpg"
        },
        {
          "title": "Calculator",
          "description": "This is a calculator that I made for a freecodecamp project. I really like the way it turned out. Feel free to test it out it is fully functional. I used jquery and some nice looking google fonts. This was one of my first projects and it is still one of my favorites.",
          "html": "<p data-height=\"463\" data-theme-id=\"0\" data-slug-hash=\"QEwmMr\" data-default-tab=\"result\" data-user=\"davidbaindesign\" data-embed-version=\"2\" class=\"codepen\">See the Pen <a href=\"http://codepen.io/davidbaindesign/pen/QEwmMr/\">Calculator</a> by David Bain (<a href=\"http://codepen.io/davidbaindesign\">@davidbaindesign</a>) on <a href=\"http://codepen.io\">CodePen</a>.</p>",
          "img": "calculator.jpg"
        }
      ]
    },
    "contact": {
      "text": "Email: davidbaindesign@gmail.com"
    }
  }
